Tekla.Structures.DirectManipulation.Adapter.EntryPoint
Prevents a default instance of the Tekla.Structures.DirectManipulation.Adapter.EntryPoint class from being created by other methods than Tekla.Structures.DirectManipulation.Adapter.EntryPoint.InitializeDirectManipulation(System.String).
The Tekla.Structures.DirectManipulation.Adapter.EntryPoint class is an entry point class for Tekla Structures
and also the entry point class for the Direct Manipulation Platform.

Tekla.Structures.DirectManipulation.Adapter.EntryPoint.#ctor
Prevents a default instance of the Tekla.Structures.DirectManipulation.Adapter.EntryPoint class from being created.
Only Tekla.Structures.DirectManipulation.Adapter.EntryPoint.InitializeDirectManipulation(System.String) can initialize the Tekla.Structures.DirectManipulation.Adapter.EntryPoint class,
the resulting instance can then be used as an Tekla.BIM.DirectManipulation.Adapters.AdapterBase
to initialize the platform with, using the Tekla.BIM.DirectManipulation.Platform.Initialize(Tekla.BIM.DirectManipulation.Adapters.AdapterBase) method.

Tekla.Structures.DirectManipulation.Adapter.EntryPoint.Instance
Gets the singleton instance of the DM adapter.

Tekla.Structures.DirectManipulation.Adapter.EntryPoint.InitializeDirectManipulation(System.String)
Initializes the Direct Manipulation Platform for the calling Tekla Structures process.
This method should only be called from Tekla Structures Core and must only be called once.
Remarks:
When changing the method name and Akit reference, also change the following in TS core:
- application.init.c
- mdl_actions.ail
param: The parameter data.
Returns: 1 for success, 0 for failure.

Tekla.Structures.DirectManipulation.Adapter.EntryPoint.GetDefaultLocalizationFiles
Gets the file names of the default localization files.
Returns: The file names of the default localization files.

Tekla.Structures.DirectManipulation.Adapter.EntryPoint.GetMainExecutablePath
Gets the application execution path.
Returns:
TS execution path

Tekla.Structures.DirectManipulation.Adapter.EntryPoint.GetFeaturePluginDirectories
Gets the directories that must be scanned by the platform for feature plug-ins.
Returns: The directories to load the feature plug-ins from.

Tekla.Structures.DirectManipulation.Adapter.EntryPoint.Initialize(Tekla.BIM.DirectManipulation.IPlatformInformationRetriever)
Initializes the adapter.
platformRetriever: The platform information retriever.

Tekla.Structures.DirectManipulation.Adapter.EntryPoint.OnPlatformStateChanged(System.Collections.Generic.ICollection{Tekla.BIM.DirectManipulation.Services.State.CommandDescriptor})
Occurs when the platform state has been changed.
commandStack: The command stack.